print “Υπάρχουν τρία είδη τριγώνων ανάλογα με τοις μοίρες των γωνιών του τα οξυγώνια τα ορθογώνια και τα αμβλυγώνια τρίγωνα”
print “παρόλα αυτά ομως για να είναι τρίγωνα θα πρέπει να έχουν άθροισμα 180 μοιρών”

a = input('Εισήγαγε τοις μοίρες της πρώτης γωνίας : ')   # Ζητούμε από το χρήστη να εισάγει τον αριθμό που επιθυμεί
b = input('Εισήγαγε τοις μοίρες της δεύτερης γωνίας : ') 
c =input('Εισήγαγε τοις μοίρες της τρίτης γωνίας : ') 



                  
 def  Triangle(a,b,c):                                                                                                                       
   if(a+b+c==180 & ((a|b|c)>=90): 
        result = 2                                # Οι συνθήκες σύγκρισης για να εξάγουμε τα συμπεράσματα      
else if (a+b+c==180 & ((a|b|c)==90) ): # μας είναι το εάν το αθροισμα των γωνιών είναι ίσο με 180   
        result = 3                                           # ωστέ να είναι τρίγωνο και εάν μια απο τις γωνίες του 
 else   if (a+b+c==180):                             # είναι αμβλύα η ορθύ.
         result = 1                                          # Εαν το αθροισμα των γωνιών μπορούν να 
 else:                                                          # δημιουργήσουν αλλα να δεν εχουν αμβλύ γωνίες 
       result = -1                                            # ή ορθές τότε είναι οξυγώνια τρίγωνα
    
return result


print(Triangle(a,b,c))   # εμφανίζουμε το αποτέλεσμα στο χρήστη  