x = input('Choose a number: ')  # Ζητούμε από το χρήστη να εισάγει τον αριθμό που επιθυμεί

def  f(x): 
i= 0     #η συγκεκριμένη μεταβλητή χρησιμοποιείτε για να μετρήσουμε τον αριθμό των πολλαπλασιασμών που εχουν πραγματοποιηθει στη συνάρτηση
    n = [] # ο πίνακας που θα χρησιμοποιήσουμε ωστέ να πολλαπλασιάσουμε τα ψηφία του αριθμού μεταξύ τους
n += str(x) # χωρίζουμε τον αριθμό και τον τοποθετούμε σε μία λίστα
while (len(n) >1 ) do: #υπολογίζει το μήκος της λίστας n και εκτελει τη διαδικασία μέσα στο while loop μέχρι να γίνειτο μήκος της λίστας 1 
  i=i+1 
total=1
    for i in range(0,len(n)) # Πολλαπλασιάζει τα ψηφία της λίστας μεταξύ τους 
        total*=n[i]
    return i #επιστρέφει τον αριθμό των πολλαπλασιασμών που πραγμτοποιήθηκαν 

print(f(x))   # εμφανίζει το αποτέλεσμα στο χρήστη  
